month_number = int(input("Введите номер месяца от 1 до 12: "))
season_list = ['Зима', 'Зима', 'Весна',
               'Весна', 'Весна', 'Лето',
               'Лето', 'Лето', 'Осень',
               'Осень', 'Осень', 'Зима']
print(f'По списку: {season_list[month_number - 1]} ')

season_dict = {1: 'Зима', 2: 'Зима', 3: 'Весна',
               4: 'Весна', 5: 'Весна', 6: 'Лето',
               7: 'Лето', 8: 'Лето', 9: 'Осень',
               10: 'Осень', 11: 'Осень', 12: 'Зима'}
print(f'По словарю: {season_dict.get(month_number)}')
